blog/app/controllers/api/v1/posts_controller.rb

      def index
        posts = Post.order(created_at: :desc)
---
SELECT "posts".* FROM "posts" ORDER BY "posts"."created_at" DESC

      def create
        post = Post.new(post_params)
        if post.save
---
INSERT INTO "posts" ("title", "created_at", "updated_at") VALUES (?, ?, ?)  [["title", "ああああ"], ["created_at", "2023-07-28 04:50:55.958670"], ["updated_at", "2023-07-28 04:50:55.958670"]]